---
kind: other
id: Methods.T:Autodesk.Revit.DB.FacetingUtils
source: html/f994c071-5b8e-01db-e4b3-232c2a1ec387.htm
---
# FacetingUtils Methods

Replaces pairs of adjacent, coplanar triangles by quadrilaterals.